# **INDIA**

In [ ]:
import pandas as pd
import numpy as np                       
import matplotlib.pyplot as plt      
import seaborn as sns
from sklearn.feature_extraction.text import CountVectorizer
from sklearn.feature_extraction import DictVectorizer
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import MultinomialNB

In [ ]:
df = pd.read_csv('/content/X_train_K.txt')

In [ ]:
df_test = pd.read_csv('/content/Train_K.txt')

In [ ]:
df_test_ind = df_test[df_test['Race']=="Indian"]
df_test_ind

           Id              Name  Count    Race
20     299084           sangeta    NaN  Indian
68     299132             suman    NaN  Indian
82     299146    smt. nena devi    NaN  Indian
86     299150      deepak kumar    NaN  Indian
88     299152  priyanka  kumari    NaN  Indian
...       ...               ...    ...     ...
99635  398699           khursid    NaN  Indian
99647  398711       aajad singh    NaN  Indian
99657  398721             manju    NaN  Indian
99678  398742          priyanka    NaN  Indian
99686  398750           shivani    NaN  Indian

[7541 rows x 4 columns]

In [ ]:
df_test_usa = df_test[df_test['Race']=="USA"]
df_test_usa

           Id         Name  Count Race
0      299064      Aundria    8.0  USA
1      299065      Traviss    5.0  USA
2      299066       Daleon    8.0  USA
3      299067      Porchia   48.0  USA
4      299068  Josealfredo    7.0  USA
...       ...          ...    ...  ...
99682  398746        Paolo  104.0  USA
99683  398747        Tylil    5.0  USA
99684  398748     Gesselle   13.0  USA
99685  398749       Tremon    9.0  USA
99687  398751        Kalin   46.0  USA

[92147 rows x 4 columns]

In [ ]:
df_ind = df[df['Race']=="Indian"]
df_ind

            Id            Name  Count    Race  Gender
40          40          bharti    NaN  Indian       1
51          51       ku. reetu    NaN  Indian       1
58          58           rahul    NaN  Indian       0
60          60    kumari joyti    NaN  Indian       1
88          88    sanjit misra    NaN  Indian       0
...        ...             ...    ...     ...     ...
299013  299013          lalita    NaN  Indian       1
299020  299020  vinod @ babloo    NaN  Indian       0
299031  299031        sangeeta    NaN  Indian       1
299054  299054          anisha    NaN  Indian       1
299058  299058          deepak    NaN  Indian       0

[22631 rows x 5 columns]

In [ ]:
Xfeatures =df_ind['Name']

In [ ]:
cv = CountVectorizer()
X = cv.fit_transform(Xfeatures)

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
Y = df_ind['Gender']

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size=0.33, random_state=42)

In [ ]:
clf = MultinomialNB()
clf.fit(X_train,y_train)
clf.score(X_test,y_test)

0.902664345963315

In [ ]:
def genderpredictor_ind(a):
    test_name = [a]
    vector = cv.transform(test_name).toarray()
    if clf.predict(vector) == 1:
        return 1;
    else:
        return 0;

In [ ]:
genderpredictor_ind('bala')

1

# **USA**

In [ ]:
df_usa = df[df['Race']=="USA"]
df_usa

            Id       Name  Count Race  Gender
0            0     Jayton    8.0  USA       0
1            1     Jorgen   13.0  USA       0
2            2      Sahir   20.0  USA       0
3            3  Jenneffer    5.0  USA       1
4            4      Maceo   32.0  USA       0
...        ...        ...    ...  ...     ...
299057  299057   Daishawn   27.0  USA       0
299059  299059    Rayshun   12.0  USA       0
299060  299060    Madeeha    5.0  USA       1
299061  299061    Shamyah    8.0  USA       1
299062  299062    Dynasty  104.0  USA       1

[276432 rows x 5 columns]

In [ ]:
def vowels(name):
  vowels=0
  for i in name:
      if(i=='a' or i=='e' or i=='i' or i=='o' or i=='u' or i=='A' or i=='E' or i=='I' or i=='O' or i=='U'):
            vowels=vowels+1
  return vowels

def consonants(name):
  consonants=0
  for i in name:
      if(i!='a' and i!='e' and i!='i' and i!='o' and i!='u' and i!='A' and i!='E' and i!='I' and i!='O' and i!='U'):
            consonants=consonants+1
  return consonants

In [ ]:
def features(name, count):
    name = name.lower()
    return {
        'count': count,
        'first-letter': name[0], # First letter
        'first2-letters': name[0:2], # First 2 letters
        'first3-letters': name[0:3], # First 3 letters
        'last-letter': name[-1],
        'last2-letters': name[-2:],
        'last3-letters': name[-3:],
        'length': len(name),
        'vowels': vowels(name),
        'consonants': consonants(name)
    }

In [ ]:
features = np.vectorize(features)

In [ ]:
df_X = features(df_usa['Name'],df_usa['Count'])
df_Y = df_usa['Gender']

In [ ]:
dv = DictVectorizer()

In [ ]:
dfX_train, dfX_test, dfy_train, dfy_test = train_test_split(df_X, df_Y, test_size=0.33, random_state=42)

In [ ]:
dv = DictVectorizer()
dv.fit_transform(dfX_train)

<185209x7493 sparse matrix of type '<class 'numpy.float64'>'
	with 1852090 stored elements in Compressed Sparse Row format>

In [ ]:
dclf = DecisionTreeClassifier()
my_xfeatures =dv.transform(dfX_train)
dclf.fit(my_xfeatures, dfy_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [ ]:
print(dclf.score(dv.transform(dfX_test), dfy_test))

0.913629238240356

In [ ]:
def genderpredictor_usa(a,n):
    test_name1 = [a]
    count = [n]
    transform_dv =dv.transform(features(test_name1,count))
    vector = transform_dv.toarray()
    if dclf.predict(vector) == 1:
        return 1;
    else:
        return 0;

# **Predicting Gender**

In [ ]:
Gender = []
for i in df_test.index:
  Race = df_test['Race'][i]
  if Race == 'Indian' :
    Name = df_test['Name'][i] 
    Id = df_test['Id'][i]
    gender = genderpredictor_ind(Name)
  elif Race == 'USA' :
    Name = df_test['Name'][i]
    count = df_test['Count'][i] 
    Id = df_test['Id'][i]
    gender = genderpredictor_usa(Name, count)
  Gender.append(gender)
  #print(Id, ':' ,Name , ':' , gender)

In [ ]:
outputpredictions=df_test.copy()
outputpredictions['Gender'] = Gender
outputpredictions = outputpredictions.drop(['Name', 'Count', 'Race'], axis = 1)

outputpredictions.to_csv('Sample_Solution_K.csv' ,index = False, header = True)
print("Saved")

Saved